# 2)კომენტარის მეშვეობით ახსენით რა არის bug და debugging.
# ბაგი არის შეცდომა კოდში. 
# დიბაგინგი არის შეცდომის გასასწორებლად და მისი გამოსასწორებლად შესაძლებელი საშუალება.
# 3)დაწერეთ კოდი შეცდომებით და ქვემოთ მიუწერეთ მისი სწორი ვერსია.
#name = avto
#print(name)
# სწორი ვერსია
#name = "avto"
#print(name)
# სიტყვა არის სტრინგი და ჭირდება ბრჭყალების გამოყენება.
#x = 28
#y = age
#print(x + y)
# ამ კოდში სტრინგს ვერ მივუმატებთ ინტეჯერს

# 4)გააკეთეთ ხუთ ხუთი მაგალითი ყველა განვლილ მათემატიკურ ოპერატორზე.
x = 14
y = 43
print(x + y)
print(x - y)
print(x * y)
print(x / y)

x = 56
y = 32
z = 43
result = x + y + z
print(result)

x = 23
y = 45
print(x + y)

username = "avto"
lastname = "iashagashvili"
print(username + " " + lastname)

# 5)შექმენით ცვლადები და შიგნით შეინახეთ თქვენი ოჯახის წევრების ასაკები, საბოლოოდ დაბეჭდეთ ყველა ასაკის ჯამი.
avto = 29
likuna = 24
toma = 4
noe = 1
result = avto + likuna + toma + noe
print(result)

# 6) კომენტარებით აღწერეთ, რა არის დროებითი მეხსიერება და რისთვის გვჭირდება ის.
# დროებითი მეხსიერება არის როდესაც მცირე დროის განვალობაში ინახავს და კონკრეტულ მომენტში იყენებს ამ მონაცემს.

# 7) აიღეთ ნებისმიერი რიცხვი, მაგალითად 50. გადაიყვანეთ იგი ორობით სისტემაში, მიღებული შედეგი კი დააბრუნეთ ათობითში. 
# დახატეთ და ახსენით ეს დავალება paint-ის გამოყენებით(დასქრინეთ თქვენი ნამუშევარი)
#60 ორობით სისტემაში არის 111100

# 8) ისწავლეთ ეს სიტყვები: create(შექმნა) / variable(ცვლადი)