#)გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ
'''
full_name = "Avtandil Iashashvili"
print(29 * full_name)

#3)გამოიტანეთ ტერმინალში რიცხვები 1-დან 20-ის ჩათვლით
for i in range(1, 21):
    print(i)

#4)გამოიტანეთ ტერმინალში რიცხვები 20-დან 0-მდე
for i in range(20, -1, -1):
    print(i)
'''
#5)გამოითვალეთ 1-დან 50-ის ჩათვლით ყველა რიცხვის ჯამი და დაპრინტეთ საბოლოო შედეგი
'''
sum = 0
for i in range(50):
    sum = sum + i
    print(sum)


      
    


#6)დაბეჭდეთ 1-დან 5-ის ჩათვლით რიცხვთა კვადრატი(n * n)
for n in range(1, 6):
    print(n * n)
'''
#7)დაბეჭდეთ ყველა ლუწი რიცხვის ჯამი 1-დან 10-ის ჩათვლით
sum = 0
for i in range(1, 11):
    if i % 2 == 0:
        sum += i
print(sum)

#8)მომხარებელს შემოატანინეთ რიცხვი და შეინახეთ ცვლადში, შემდეგ კი 0-დან შემოტანილი რიცხვის ჩათვლით შეამოწმეთ,
#  თუ ლუწია დაბეჭდეთ რიცხვი is Even, სხვა შემთხვევაში რიცხვი is Odd;(მაგალითად 4, ლუწია ამიტომაც დაბეჭდავთ "4 is Even")
'''
num = int(input("Enter a number: "))
if num % 2 == 0:
    print("is Even")
else:
    print("is Odd")    

#ამ დავალებების შესასრულებლად გამოიყენეთ for loop-ი'
'''