#3) კომენტარებით აღზერე ცვლადის შექმნის თითოეული ნაბიჯი(სულ 3).
#პირველ რიგში შევქმნით ცვლადს,მეორე რიგში ვანიჭებთ მნიშვნელობას მონაცების მიხედვით მესამე რიგში და ვიყენებთ ცვლადს სხვადასხვა ოპერაციებში.


#4) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი
num1 = 10
num2 = 20 
print(num1 + num2)


#5) შექმენით ორი ცვლადი x, y და დაპრინტეთ მათი ნამრავლი.
x = 15
y = 34
print(x * y)

#6) მართკუთხედის პერიმეტრი:
# შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), 
# მიანიჭეთ მნიშვნელობებად 20 და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და დაპრინტეთ.
length = 20
width = 10
print(2 * (length + width))


#7) შექმენით სამი ცვლადი age1, age2, age3, სადაც შეინახავთ თქვენი და ოჯახის წევრების ასაკს.
# გაიგეთ ცვლადებში შენახული მნიშვნელობების საშუალო არითმეტიკული და დაპრინტეთ.
age1 = 29
age2 = 24
age3 = 4
age4 = 1
print((age1 + age2 + age3 + age4) / 4)


#8) შექმენით ორი ცვლადი, პირველში შეინახეთ თქვენი სახელი, მეორეში გვარი. 
# მოახდინეთ კონკადინაცია(რესურსებში არის ჩაგდებული და გადახედეთ) ამ ორ ცვლადს შორის და პასუხი შეინახეთ ახალ ცვლადში სახელად result. 
# დაბეჭდეთ result ცვლადი.
username = "Avtandil"
surname = "Iashagashvili"
result = username + " " + surname
print(result)



#9) შექმენით ორი ცვლადი age და fullname, პირველში შეინახეთ თქვენი ასაკი, ხოლო მეორეში სრული სახელი(სახელი და გვარი). 
# დაბეჭდეთ fullname ცვლადში შენახული მნიშვნელობა იმდენჯერ, რამდენი წლისაც ხართ(გამოიყენე შექმნილი age ცვლადი).
# დაბეჭდე ერთი print()-ფუნქციის მეშვეობით
fullname = "Avtandil Iashagashvili"
age = 29
print(fullname * age)



#10) კომენტარებით დაწერე, თუ რა არის დეკლარაცია, ინიციალიზიება და რეინიციალიზება. 
# ახსენი რა განსხვავებაა ამათ შორის და მოიყვანე თითოეულზე 2-2 მაგალითი
# დეკლარაცია - ცვლადის შექმნა
# ინიციალიზიება - ცვლადის მნიშვნელობის მინიჭება
# რეინიციალიზება - ცვლადის მნიშვნელობის შეცვლა
'''
num      ეს არის დეკლარაცია
num = 15 ეს არის ინიციალიზაცია
num = 20 ეს არის რეინიციალიზაცია
print(num) რეინიციალიზაციის შემდეგ გამოიტანს 20-ს
მაგალითი 2:
name      ეს არის დეკლარაცია '
name = "Avtandil" ეს არის ინიციალიზაცია
name = "Giorgi" ეს არის რეინიციალიზაცია
print(name) რეინიციალიზაციის შემდეგ გამოიტანს Giorgi-ს
'''