#2) შექმენით პროგრამა while ციკლის საშვალებით რომელიც გამოთვლის ყველა ნატურალური რიცხვის ჯამს 1-იდან 50-მდე
num = 0
i = 1
while i <= 49:
    num = num + i
    i = i + 1
    print(num)

#3) შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) მანამდე სანამ არ შეიყვანს 12##34-ს
pin = int(input("Enter your pin code: "))
while pin != 1234:
    pin = int(input("Enter your pin code again: "))
else:
    print("Correct pin code")
#4) შექმნით რიცხვის გამოცნობის თამაში while ციკლით, რომელიც მომხმარებელს შეეკითხება რიცხვს 1-დან 10-მდე, 
# სანამ მომხმარებელი არ შეიყვანს თქვენთვის სასურველ რიცხვს
my_number = input("Guess my number: ")
while my_number != "8":
    my_number = input("Try again: ")
else:

    print("Congrs! You guess my number " + ":)" )

#5) ტექსტურ ფაილში ახსენით როდის ვიყენებთ while ციკლს და როდის for ციკლს
#While ციკლი გამოიყენება მაშინ, როდესაც არ ვიცით, რამდენჯერ უნდა შესრულდეს ციკლი, მაგრამ ვიცით, თუ როდის უნდა შეწყდეს.
# for ციკლი გამოიყენება მაშინ, როდესაც ვიცით ან გვსურს ვიმუშაოთ კონკრეტულ რაოდენობის ელემენტებზე.
